program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3405.2.1"}, {"coremlc-version", "3404.23.1"}, {"coremltools-component-tensorflow", "2.16.2"}, {"coremltools-version", "8.2"}})]
{
    func main<ios15>(tensor<fp32, [1, 3, 320, 576]> input) {
            tensor<int32, []> model_concatenate_concat_axis = const()[name = tensor<string, []>("model_concatenate_concat_axis"), val = tensor<int32, []>(1)];
            tensor<int32, []> model_concatenate_3_concat_axis = const()[name = tensor<string, []>("model_concatenate_3_concat_axis"), val = tensor<int32, []>(1)];
            tensor<int32, []> model_concatenate_5_concat_axis = const()[name = tensor<string, []>("model_concatenate_5_concat_axis"), val = tensor<int32, []>(1)];
            tensor<int32, []> model_concatenate_8_concat_axis = const()[name = tensor<string, []>("model_concatenate_8_concat_axis"), val = tensor<int32, []>(1)];
            tensor<int32, []> model_concatenate_11_concat_axis = const()[name = tensor<string, []>("model_concatenate_11_concat_axis"), val = tensor<int32, []>(1)];
            tensor<int32, []> model_concatenate_14_concat_axis = const()[name = tensor<string, []>("model_concatenate_14_concat_axis"), val = tensor<int32, []>(1)];
            tensor<int32, []> model_concatenate_18_concat_axis = const()[name = tensor<string, []>("model_concatenate_18_concat_axis"), val = tensor<int32, []>(1)];
            tensor<fp32, [128]> model_batch_normalization_2_ReadVariableOp = const()[name = tensor<string, []>("model_batch_normalization_2_ReadVariableOp"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp32, [128]> model_batch_normalization_2_ReadVariableOp_1 = const()[name = tensor<string, []>("model_batch_normalization_2_ReadVariableOp_1"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(640)))];
            tensor<fp32, [128]> model_batch_normalization_2_FusedBatchNormV3_ReadVariableOp = const()[name = tensor<string, []>("model_batch_normalization_2_FusedBatchNormV3_ReadVariableOp"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1216)))];
            tensor<fp32, [128]> model_batch_normalization_2_FusedBatchNormV3_ReadVariableOp_1 = const()[name = tensor<string, []>("model_batch_normalization_2_FusedBatchNormV3_ReadVariableOp_1"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1792)))];
            tensor<fp32, [128]> model_batch_normalization_3_ReadVariableOp = const()[name = tensor<string, []>("model_batch_normalization_3_ReadVariableOp"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2368)))];
            tensor<fp32, [128]> model_batch_normalization_3_ReadVariableOp_1 = const()[name = tensor<string, []>("model_batch_normalization_3_ReadVariableOp_1"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2944)))];
            tensor<fp32, [128]> model_batch_normalization_3_FusedBatchNormV3_ReadVariableOp = const()[name = tensor<string, []>("model_batch_normalization_3_FusedBatchNormV3_ReadVariableOp"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3520)))];
            tensor<fp32, [128]> model_batch_normalization_3_FusedBatchNormV3_ReadVariableOp_1 = const()[name = tensor<string, []>("model_batch_normalization_3_FusedBatchNormV3_ReadVariableOp_1"), val = tensor<fp32, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4096)))];
            tensor<string, []> input_to_fp16_dtype_0 = const()[name = tensor<string, []>("input_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, []> model_rescaling_Cast_x_to_fp16 = const()[name = tensor<string, []>("model_rescaling_Cast_x_to_fp16"), val = tensor<fp16, []>(0x1.01p-7)];
            tensor<fp16, [1, 3, 320, 576]> input_to_fp16 = cast(dtype = input_to_fp16_dtype_0, x = input)[name = tensor<string, []>("cast_86")];
            tensor<fp16, [1, 3, 320, 576]> model_rescaling_mul_cast_fp16 = mul(x = input_to_fp16, y = model_rescaling_Cast_x_to_fp16)[name = tensor<string, []>("model_rescaling_mul_cast_fp16")];
            tensor<fp16, []> model_rescaling_Cast_1_to_fp16 = const()[name = tensor<string, []>("model_rescaling_Cast_1_to_fp16"), val = tensor<fp16, []>(-0x1p+0)];
            tensor<fp16, [1, 3, 320, 576]> model_rescaling_add_cast_fp16 = add(x = model_rescaling_mul_cast_fp16, y = model_rescaling_Cast_1_to_fp16)[name = tensor<string, []>("model_rescaling_add_cast_fp16")];
            tensor<string, []> model_Conv_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_Conv_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_Conv_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_Conv_Conv2Dx_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> model_Conv_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_Conv_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_Conv_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_Conv_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_Conv_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_Conv_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 3, 3, 3]> const_209_to_fp16 = const()[name = tensor<string, []>("const_209_to_fp16"), val = tensor<fp16, [16, 3, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4672)))];
            tensor<fp16, [16]> const_210_to_fp16 = const()[name = tensor<string, []>("const_210_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5632)))];
            tensor<fp16, [1, 16, 160, 288]> model_Conv_BatchNorm_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_210_to_fp16, dilations = model_Conv_Conv2Dx_dilations_0, groups = model_Conv_Conv2Dx_groups_0, pad = model_Conv_Conv2Dx_pad_0, pad_type = model_Conv_Conv2Dx_pad_type_0, strides = model_Conv_Conv2Dx_strides_0, weight = const_209_to_fp16, x = model_rescaling_add_cast_fp16)[name = tensor<string, []>("model_Conv_BatchNorm_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, []> model_tf___operators___add_y_to_fp16 = const()[name = tensor<string, []>("model_tf___operators___add_y_to_fp16"), val = tensor<fp16, []>(0x1.8p+1)];
            tensor<fp16, [1, 16, 160, 288]> model_tf___operators___add_AddV2_cast_fp16 = add(x = model_Conv_BatchNorm_FusedBatchNormV3_nchw_cast_fp16, y = model_tf___operators___add_y_to_fp16)[name = tensor<string, []>("model_tf___operators___add_AddV2_cast_fp16")];
            tensor<fp16, [1, 16, 160, 288]> model_re_lu_Relu6_cast_fp16 = relu6(x = model_tf___operators___add_AddV2_cast_fp16)[name = tensor<string, []>("model_re_lu_Relu6_cast_fp16")];
            tensor<fp16, []> model_tf_math_multiply_Mul_y_to_fp16 = const()[name = tensor<string, []>("model_tf_math_multiply_Mul_y_to_fp16"), val = tensor<fp16, []>(0x1.554p-3)];
            tensor<fp16, [1, 16, 160, 288]> model_tf_math_multiply_Mul_cast_fp16 = mul(x = model_re_lu_Relu6_cast_fp16, y = model_tf_math_multiply_Mul_y_to_fp16)[name = tensor<string, []>("model_tf_math_multiply_Mul_cast_fp16")];
            tensor<fp16, [1, 16, 160, 288]> model_multiply_mul_cast_fp16 = mul(x = model_Conv_BatchNorm_FusedBatchNormV3_nchw_cast_fp16, y = model_tf_math_multiply_Mul_cast_fp16)[name = tensor<string, []>("model_multiply_mul_cast_fp16")];
            tensor<string, []> model_expanded_conv_depthwise_depthwisex_pad_type_0 = const()[name = tensor<string, []>("model_expanded_conv_depthwise_depthwisex_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_expanded_conv_depthwise_depthwisex_strides_0 = const()[name = tensor<string, []>("model_expanded_conv_depthwise_depthwisex_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_expanded_conv_depthwise_depthwisex_dilations_0 = const()[name = tensor<string, []>("model_expanded_conv_depthwise_depthwisex_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_expanded_conv_depthwise_depthwisex_groups_0 = const()[name = tensor<string, []>("model_expanded_conv_depthwise_depthwisex_groups_0"), val = tensor<int32, []>(16)];
            tensor<int32, [4]> model_expanded_conv_depthwise_depthwisex_pad_0 = const()[name = tensor<string, []>("model_expanded_conv_depthwise_depthwisex_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 1, 3, 3]> const_211_to_fp16 = const()[name = tensor<string, []>("const_211_to_fp16"), val = tensor<fp16, [16, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5760)))];
            tensor<fp16, [16]> const_212_to_fp16 = const()[name = tensor<string, []>("const_212_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6144)))];
            tensor<fp16, [1, 16, 160, 288]> model_expanded_conv_depthwise_BatchNorm_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_212_to_fp16, dilations = model_expanded_conv_depthwise_depthwisex_dilations_0, groups = model_expanded_conv_depthwise_depthwisex_groups_0, pad = model_expanded_conv_depthwise_depthwisex_pad_0, pad_type = model_expanded_conv_depthwise_depthwisex_pad_type_0, strides = model_expanded_conv_depthwise_depthwisex_strides_0, weight = const_211_to_fp16, x = model_multiply_mul_cast_fp16)[name = tensor<string, []>("model_expanded_conv_depthwise_BatchNorm_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, [1, 16, 160, 288]> model_re_lu_1_Relu_cast_fp16 = relu(x = model_expanded_conv_depthwise_BatchNorm_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_re_lu_1_Relu_cast_fp16")];
            tensor<string, []> model_expanded_conv_project_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_expanded_conv_project_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_expanded_conv_project_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_expanded_conv_project_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_expanded_conv_project_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_expanded_conv_project_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_expanded_conv_project_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_expanded_conv_project_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_expanded_conv_project_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_expanded_conv_project_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 16, 1, 1]> const_213_to_fp16 = const()[name = tensor<string, []>("const_213_to_fp16"), val = tensor<fp16, [16, 16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6272)))];
            tensor<fp16, [16]> const_214_to_fp16 = const()[name = tensor<string, []>("const_214_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6848)))];
            tensor<fp16, [1, 16, 160, 288]> model_expanded_conv_project_BatchNorm_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_214_to_fp16, dilations = model_expanded_conv_project_Conv2Dx_dilations_0, groups = model_expanded_conv_project_Conv2Dx_groups_0, pad = model_expanded_conv_project_Conv2Dx_pad_0, pad_type = model_expanded_conv_project_Conv2Dx_pad_type_0, strides = model_expanded_conv_project_Conv2Dx_strides_0, weight = const_213_to_fp16, x = model_re_lu_1_Relu_cast_fp16)[name = tensor<string, []>("model_expanded_conv_project_BatchNorm_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, [1, 16, 160, 288]> model_expanded_conv_Add_add_cast_fp16 = add(x = model_multiply_mul_cast_fp16, y = model_expanded_conv_project_BatchNorm_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_expanded_conv_Add_add_cast_fp16")];
            tensor<string, []> model_expanded_conv_1_expand_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_expanded_conv_1_expand_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_expanded_conv_1_expand_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_expanded_conv_1_expand_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_expanded_conv_1_expand_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_expanded_conv_1_expand_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_expanded_conv_1_expand_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_expanded_conv_1_expand_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_expanded_conv_1_expand_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_expanded_conv_1_expand_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 16, 1, 1]> const_215_to_fp16 = const()[name = tensor<string, []>("const_215_to_fp16"), val = tensor<fp16, [64, 16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6976)))];
            tensor<fp16, [64]> const_216_to_fp16 = const()[name = tensor<string, []>("const_216_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9088)))];
            tensor<fp16, [1, 64, 160, 288]> model_expanded_conv_1_expand_BatchNorm_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_216_to_fp16, dilations = model_expanded_conv_1_expand_Conv2Dx_dilations_0, groups = model_expanded_conv_1_expand_Conv2Dx_groups_0, pad = model_expanded_conv_1_expand_Conv2Dx_pad_0, pad_type = model_expanded_conv_1_expand_Conv2Dx_pad_type_0, strides = model_expanded_conv_1_expand_Conv2Dx_strides_0, weight = const_215_to_fp16, x = model_expanded_conv_Add_add_cast_fp16)[name = tensor<string, []>("model_expanded_conv_1_expand_BatchNorm_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, [1, 64, 160, 288]> model_re_lu_2_Relu_cast_fp16 = relu(x = model_expanded_conv_1_expand_BatchNorm_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_re_lu_2_Relu_cast_fp16")];
            tensor<string, []> pad_0_mode_0 = const()[name = tensor<string, []>("pad_0_mode_0"), val = tensor<string, []>("constant")];
            tensor<string, []> model_conv2d_33_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_conv2d_33_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_conv2d_33_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_conv2d_33_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_conv2d_33_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_conv2d_33_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_conv2d_33_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_conv2d_33_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_conv2d_33_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_conv2d_33_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 64, 1, 1]> transpose_12_to_fp16 = const()[name = tensor<string, []>("transpose_12_to_fp16"), val = tensor<fp16, [16, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9280)))];
            tensor<fp16, [16]> const_116_to_fp16 = const()[name = tensor<string, []>("const_116_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11392)))];
            tensor<fp16, [1, 16, 160, 288]> model_conv2d_33_BiasAdd_cast_fp16 = conv(bias = const_116_to_fp16, dilations = model_conv2d_33_Conv2Dx_dilations_0, groups = model_conv2d_33_Conv2Dx_groups_0, pad = model_conv2d_33_Conv2Dx_pad_0, pad_type = model_conv2d_33_Conv2Dx_pad_type_0, strides = model_conv2d_33_Conv2Dx_strides_0, weight = transpose_12_to_fp16, x = model_re_lu_2_Relu_cast_fp16)[name = tensor<string, []>("model_conv2d_33_BiasAdd_cast_fp16")];
            tensor<int32, [8]> pad_4_pad_0 = const()[name = tensor<string, []>("pad_4_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 0, 1, 0, 1])];
            tensor<fp16, []> const_0_to_fp16 = const()[name = tensor<string, []>("const_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 64, 161, 289]> pad_4_cast_fp16 = pad(constant_val = const_0_to_fp16, mode = pad_0_mode_0, pad = pad_4_pad_0, x = model_re_lu_2_Relu_cast_fp16)[name = tensor<string, []>("pad_4_cast_fp16")];
            tensor<string, []> model_expanded_conv_1_depthwise_depthwisex_pad_type_0 = const()[name = tensor<string, []>("model_expanded_conv_1_depthwise_depthwisex_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> model_expanded_conv_1_depthwise_depthwisex_strides_0 = const()[name = tensor<string, []>("model_expanded_conv_1_depthwise_depthwisex_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> model_expanded_conv_1_depthwise_depthwisex_dilations_0 = const()[name = tensor<string, []>("model_expanded_conv_1_depthwise_depthwisex_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_expanded_conv_1_depthwise_depthwisex_groups_0 = const()[name = tensor<string, []>("model_expanded_conv_1_depthwise_depthwisex_groups_0"), val = tensor<int32, []>(64)];
            tensor<int32, [4]> model_expanded_conv_1_depthwise_depthwisex_pad_0 = const()[name = tensor<string, []>("model_expanded_conv_1_depthwise_depthwisex_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 1, 3, 3]> const_217_to_fp16 = const()[name = tensor<string, []>("const_217_to_fp16"), val = tensor<fp16, [64, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11520)))];
            tensor<fp16, [64]> const_218_to_fp16 = const()[name = tensor<string, []>("const_218_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12736)))];
            tensor<fp16, [1, 64, 80, 144]> model_expanded_conv_1_depthwise_BatchNorm_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_218_to_fp16, dilations = model_expanded_conv_1_depthwise_depthwisex_dilations_0, groups = model_expanded_conv_1_depthwise_depthwisex_groups_0, pad = model_expanded_conv_1_depthwise_depthwisex_pad_0, pad_type = model_expanded_conv_1_depthwise_depthwisex_pad_type_0, strides = model_expanded_conv_1_depthwise_depthwisex_strides_0, weight = const_217_to_fp16, x = pad_4_cast_fp16)[name = tensor<string, []>("model_expanded_conv_1_depthwise_BatchNorm_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<int32, [2]> model_global_average_pooling2d_7_Mean_axes_0 = const()[name = tensor<string, []>("model_global_average_pooling2d_7_Mean_axes_0"), val = tensor<int32, [2]>([1, 2])];
            tensor<bool, []> model_global_average_pooling2d_7_Mean_keep_dims_0 = const()[name = tensor<string, []>("model_global_average_pooling2d_7_Mean_keep_dims_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_369_perm_0 = const()[name = tensor<string, []>("transpose_369_perm_0"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<fp16, [1, 160, 288, 16]> transpose_369_cast_fp16 = transpose(perm = transpose_369_perm_0, x = model_conv2d_33_BiasAdd_cast_fp16)[name = tensor<string, []>("transpose_401")];
            tensor<fp16, [1, 16]> model_global_average_pooling2d_7_Mean_cast_fp16 = reduce_mean(axes = model_global_average_pooling2d_7_Mean_axes_0, keep_dims = model_global_average_pooling2d_7_Mean_keep_dims_0, x = transpose_369_cast_fp16)[name = tensor<string, []>("model_global_average_pooling2d_7_Mean_cast_fp16")];
            tensor<int32, [2]> model_global_max_pooling2d_4_Max_axes_0 = const()[name = tensor<string, []>("model_global_max_pooling2d_4_Max_axes_0"), val = tensor<int32, [2]>([1, 2])];
            tensor<bool, []> model_global_max_pooling2d_4_Max_keep_dims_0 = const()[name = tensor<string, []>("model_global_max_pooling2d_4_Max_keep_dims_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 16]> model_global_max_pooling2d_4_Max_cast_fp16 = reduce_max(axes = model_global_max_pooling2d_4_Max_axes_0, keep_dims = model_global_max_pooling2d_4_Max_keep_dims_0, x = transpose_369_cast_fp16)[name = tensor<string, []>("model_global_max_pooling2d_4_Max_cast_fp16")];
            tensor<fp16, [1, 64, 80, 144]> model_re_lu_3_Relu_cast_fp16 = relu(x = model_expanded_conv_1_depthwise_BatchNorm_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_re_lu_3_Relu_cast_fp16")];
            tensor<bool, []> model_concatenate_11_concat_interleave_0 = const()[name = tensor<string, []>("model_concatenate_11_concat_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 32]> model_concatenate_11_concat_cast_fp16 = concat(axis = model_concatenate_11_concat_axis, interleave = model_concatenate_11_concat_interleave_0, values = (model_global_average_pooling2d_7_Mean_cast_fp16, model_global_max_pooling2d_4_Max_cast_fp16))[name = tensor<string, []>("model_concatenate_11_concat_cast_fp16")];
            tensor<string, []> model_expanded_conv_1_project_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_expanded_conv_1_project_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_expanded_conv_1_project_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_expanded_conv_1_project_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_expanded_conv_1_project_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_expanded_conv_1_project_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_expanded_conv_1_project_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_expanded_conv_1_project_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_expanded_conv_1_project_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_expanded_conv_1_project_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [24, 64, 1, 1]> const_219_to_fp16 = const()[name = tensor<string, []>("const_219_to_fp16"), val = tensor<fp16, [24, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12928)))];
            tensor<fp16, [24]> const_220_to_fp16 = const()[name = tensor<string, []>("const_220_to_fp16"), val = tensor<fp16, [24]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(16064)))];
            tensor<fp16, [1, 24, 80, 144]> model_expanded_conv_1_project_BatchNorm_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_220_to_fp16, dilations = model_expanded_conv_1_project_Conv2Dx_dilations_0, groups = model_expanded_conv_1_project_Conv2Dx_groups_0, pad = model_expanded_conv_1_project_Conv2Dx_pad_0, pad_type = model_expanded_conv_1_project_Conv2Dx_pad_type_0, strides = model_expanded_conv_1_project_Conv2Dx_strides_0, weight = const_219_to_fp16, x = model_re_lu_3_Relu_cast_fp16)[name = tensor<string, []>("model_expanded_conv_1_project_BatchNorm_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, [4, 32]> transpose_345_cast_fp16_to_fp32_to_fp16 = const()[name = tensor<string, []>("transpose_345_cast_fp16_to_fp32_to_fp16"), val = tensor<fp16, [4, 32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(16192)))];
            tensor<fp16, [4]> model_dense_13_BiasAdd_bias_0_to_fp16 = const()[name = tensor<string, []>("model_dense_13_BiasAdd_bias_0_to_fp16"), val = tensor<fp16, [4]>([0x1.23p-5, -0x1.dd4p-4, 0x1.0ccp-2, -0x1.998p-5])];
            tensor<fp16, [1, 4]> model_dense_13_BiasAdd_cast_fp16 = linear(bias = model_dense_13_BiasAdd_bias_0_to_fp16, weight = transpose_345_cast_fp16_to_fp32_to_fp16, x = model_concatenate_11_concat_cast_fp16)[name = tensor<string, []>("model_dense_13_BiasAdd_cast_fp16")];
            tensor<string, []> model_expanded_conv_2_expand_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_expanded_conv_2_expand_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_expanded_conv_2_expand_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_expanded_conv_2_expand_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_expanded_conv_2_expand_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_expanded_conv_2_expand_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_expanded_conv_2_expand_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_expanded_conv_2_expand_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_expanded_conv_2_expand_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_expanded_conv_2_expand_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [72, 24, 1, 1]> const_221_to_fp16 = const()[name = tensor<string, []>("const_221_to_fp16"), val = tensor<fp16, [72, 24, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(16512)))];
            tensor<fp16, [72]> const_222_to_fp16 = const()[name = tensor<string, []>("const_222_to_fp16"), val = tensor<fp16, [72]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20032)))];
            tensor<fp16, [1, 72, 80, 144]> model_expanded_conv_2_expand_BatchNorm_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_222_to_fp16, dilations = model_expanded_conv_2_expand_Conv2Dx_dilations_0, groups = model_expanded_conv_2_expand_Conv2Dx_groups_0, pad = model_expanded_conv_2_expand_Conv2Dx_pad_0, pad_type = model_expanded_conv_2_expand_Conv2Dx_pad_type_0, strides = model_expanded_conv_2_expand_Conv2Dx_strides_0, weight = const_221_to_fp16, x = model_expanded_conv_1_project_BatchNorm_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_expanded_conv_2_expand_BatchNorm_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, [1, 4]> model_dense_13_Relu_cast_fp16 = relu(x = model_dense_13_BiasAdd_cast_fp16)[name = tensor<string, []>("model_dense_13_Relu_cast_fp16")];
            tensor<fp16, [16, 4]> transpose_346_cast_fp16_to_fp32_to_fp16 = const()[name = tensor<string, []>("transpose_346_cast_fp16_to_fp32_to_fp16"), val = tensor<fp16, [16, 4]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20288)))];
            tensor<fp16, [16]> model_dense_14_BiasAdd_bias_0_to_fp16 = const()[name = tensor<string, []>("model_dense_14_BiasAdd_bias_0_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20480)))];
            tensor<fp16, [1, 16]> model_dense_14_BiasAdd_cast_fp16 = linear(bias = model_dense_14_BiasAdd_bias_0_to_fp16, weight = transpose_346_cast_fp16_to_fp32_to_fp16, x = model_dense_13_Relu_cast_fp16)[name = tensor<string, []>("model_dense_14_BiasAdd_cast_fp16")];
            tensor<fp16, [1, 72, 80, 144]> model_re_lu_4_Relu_cast_fp16 = relu(x = model_expanded_conv_2_expand_BatchNorm_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_re_lu_4_Relu_cast_fp16")];
            tensor<string, []> model_expanded_conv_2_depthwise_depthwisex_pad_type_0 = const()[name = tensor<string, []>("model_expanded_conv_2_depthwise_depthwisex_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_expanded_conv_2_depthwise_depthwisex_strides_0 = const()[name = tensor<string, []>("model_expanded_conv_2_depthwise_depthwisex_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_expanded_conv_2_depthwise_depthwisex_dilations_0 = const()[name = tensor<string, []>("model_expanded_conv_2_depthwise_depthwisex_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_expanded_conv_2_depthwise_depthwisex_groups_0 = const()[name = tensor<string, []>("model_expanded_conv_2_depthwise_depthwisex_groups_0"), val = tensor<int32, []>(72)];
            tensor<int32, [4]> model_expanded_conv_2_depthwise_depthwisex_pad_0 = const()[name = tensor<string, []>("model_expanded_conv_2_depthwise_depthwisex_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [72, 1, 3, 3]> const_223_to_fp16 = const()[name = tensor<string, []>("const_223_to_fp16"), val = tensor<fp16, [72, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(20608)))];
            tensor<fp16, [72]> const_224_to_fp16 = const()[name = tensor<string, []>("const_224_to_fp16"), val = tensor<fp16, [72]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(22016)))];
            tensor<fp16, [1, 72, 80, 144]> model_expanded_conv_2_depthwise_BatchNorm_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_224_to_fp16, dilations = model_expanded_conv_2_depthwise_depthwisex_dilations_0, groups = model_expanded_conv_2_depthwise_depthwisex_groups_0, pad = model_expanded_conv_2_depthwise_depthwisex_pad_0, pad_type = model_expanded_conv_2_depthwise_depthwisex_pad_type_0, strides = model_expanded_conv_2_depthwise_depthwisex_strides_0, weight = const_223_to_fp16, x = model_re_lu_4_Relu_cast_fp16)[name = tensor<string, []>("model_expanded_conv_2_depthwise_BatchNorm_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, [1, 16]> model_dense_14_Sigmoid_cast_fp16 = sigmoid(x = model_dense_14_BiasAdd_cast_fp16)[name = tensor<string, []>("model_dense_14_Sigmoid_cast_fp16")];
            tensor<fp16, [1, 72, 80, 144]> model_re_lu_5_Relu_cast_fp16 = relu(x = model_expanded_conv_2_depthwise_BatchNorm_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_re_lu_5_Relu_cast_fp16")];
            tensor<string, []> model_expanded_conv_2_project_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_expanded_conv_2_project_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_expanded_conv_2_project_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_expanded_conv_2_project_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_expanded_conv_2_project_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_expanded_conv_2_project_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_expanded_conv_2_project_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_expanded_conv_2_project_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_expanded_conv_2_project_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_expanded_conv_2_project_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [24, 72, 1, 1]> const_225_to_fp16 = const()[name = tensor<string, []>("const_225_to_fp16"), val = tensor<fp16, [24, 72, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(22272)))];
            tensor<fp16, [24]> const_226_to_fp16 = const()[name = tensor<string, []>("const_226_to_fp16"), val = tensor<fp16, [24]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25792)))];
            tensor<fp16, [1, 24, 80, 144]> model_expanded_conv_2_project_BatchNorm_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_226_to_fp16, dilations = model_expanded_conv_2_project_Conv2Dx_dilations_0, groups = model_expanded_conv_2_project_Conv2Dx_groups_0, pad = model_expanded_conv_2_project_Conv2Dx_pad_0, pad_type = model_expanded_conv_2_project_Conv2Dx_pad_type_0, strides = model_expanded_conv_2_project_Conv2Dx_strides_0, weight = const_225_to_fp16, x = model_re_lu_5_Relu_cast_fp16)[name = tensor<string, []>("model_expanded_conv_2_project_BatchNorm_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, [1, 24, 80, 144]> model_expanded_conv_2_Add_add_cast_fp16 = add(x = model_expanded_conv_1_project_BatchNorm_FusedBatchNormV3_nchw_cast_fp16, y = model_expanded_conv_2_project_BatchNorm_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_expanded_conv_2_Add_add_cast_fp16")];
            tensor<int32, [4]> reshape_23_shape_0 = const()[name = tensor<string, []>("reshape_23_shape_0"), val = tensor<int32, [4]>([1, 16, 1, 1])];
            tensor<fp16, [1, 16, 1, 1]> reshape_23_cast_fp16 = reshape(shape = reshape_23_shape_0, x = model_dense_14_Sigmoid_cast_fp16)[name = tensor<string, []>("reshape_23_cast_fp16")];
            tensor<fp16, [1, 16, 160, 288]> model_multiply_38_mul_cast_fp16 = mul(x = model_conv2d_33_BiasAdd_cast_fp16, y = reshape_23_cast_fp16)[name = tensor<string, []>("model_multiply_38_mul_cast_fp16")];
            tensor<string, []> model_expanded_conv_3_expand_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_expanded_conv_3_expand_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_expanded_conv_3_expand_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_expanded_conv_3_expand_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_expanded_conv_3_expand_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_expanded_conv_3_expand_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_expanded_conv_3_expand_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_expanded_conv_3_expand_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_expanded_conv_3_expand_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_expanded_conv_3_expand_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [72, 24, 1, 1]> const_227_to_fp16 = const()[name = tensor<string, []>("const_227_to_fp16"), val = tensor<fp16, [72, 24, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25920)))];
            tensor<fp16, [72]> const_228_to_fp16 = const()[name = tensor<string, []>("const_228_to_fp16"), val = tensor<fp16, [72]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(29440)))];
            tensor<fp16, [1, 72, 80, 144]> model_expanded_conv_3_expand_BatchNorm_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_228_to_fp16, dilations = model_expanded_conv_3_expand_Conv2Dx_dilations_0, groups = model_expanded_conv_3_expand_Conv2Dx_groups_0, pad = model_expanded_conv_3_expand_Conv2Dx_pad_0, pad_type = model_expanded_conv_3_expand_Conv2Dx_pad_type_0, strides = model_expanded_conv_3_expand_Conv2Dx_strides_0, weight = const_227_to_fp16, x = model_expanded_conv_2_Add_add_cast_fp16)[name = tensor<string, []>("model_expanded_conv_3_expand_BatchNorm_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<string, []> model_conv2d_34_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_conv2d_34_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_conv2d_34_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_conv2d_34_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_conv2d_34_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_conv2d_34_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_conv2d_34_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_conv2d_34_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_conv2d_34_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_conv2d_34_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 16, 1, 1]> transpose_31_to_fp16 = const()[name = tensor<string, []>("transpose_31_to_fp16"), val = tensor<fp16, [16, 16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(29696)))];
            tensor<fp16, [16]> const_117_to_fp16 = const()[name = tensor<string, []>("const_117_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(30272)))];
            tensor<fp16, [1, 16, 160, 288]> model_conv2d_34_BiasAdd_cast_fp16 = conv(bias = const_117_to_fp16, dilations = model_conv2d_34_Conv2Dx_dilations_0, groups = model_conv2d_34_Conv2Dx_groups_0, pad = model_conv2d_34_Conv2Dx_pad_0, pad_type = model_conv2d_34_Conv2Dx_pad_type_0, strides = model_conv2d_34_Conv2Dx_strides_0, weight = transpose_31_to_fp16, x = model_multiply_38_mul_cast_fp16)[name = tensor<string, []>("model_conv2d_34_BiasAdd_cast_fp16")];
            tensor<fp16, [1, 72, 80, 144]> model_re_lu_6_Relu_cast_fp16 = relu(x = model_expanded_conv_3_expand_BatchNorm_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_re_lu_6_Relu_cast_fp16")];
            tensor<fp16, [1, 16, 160, 288]> model_conv2d_34_Sigmoid_cast_fp16 = sigmoid(x = model_conv2d_34_BiasAdd_cast_fp16)[name = tensor<string, []>("model_conv2d_34_Sigmoid_cast_fp16")];
            tensor<string, []> pad_1_mode_0 = const()[name = tensor<string, []>("pad_1_mode_0"), val = tensor<string, []>("constant")];
            tensor<string, []> model_conv2d_22_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_conv2d_22_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_conv2d_22_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_conv2d_22_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_conv2d_22_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_conv2d_22_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_conv2d_22_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_conv2d_22_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_conv2d_22_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_conv2d_22_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 72, 1, 1]> transpose_34_to_fp16 = const()[name = tensor<string, []>("transpose_34_to_fp16"), val = tensor<fp16, [32, 72, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(30400)))];
            tensor<fp16, [32]> const_118_to_fp16 = const()[name = tensor<string, []>("const_118_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(35072)))];
            tensor<fp16, [1, 32, 80, 144]> model_conv2d_22_BiasAdd_cast_fp16 = conv(bias = const_118_to_fp16, dilations = model_conv2d_22_Conv2Dx_dilations_0, groups = model_conv2d_22_Conv2Dx_groups_0, pad = model_conv2d_22_Conv2Dx_pad_0, pad_type = model_conv2d_22_Conv2Dx_pad_type_0, strides = model_conv2d_22_Conv2Dx_strides_0, weight = transpose_34_to_fp16, x = model_re_lu_6_Relu_cast_fp16)[name = tensor<string, []>("model_conv2d_22_BiasAdd_cast_fp16")];
            tensor<fp16, []> model_lambda_7_clip_by_value_Minimum_y_to_fp16 = const()[name = tensor<string, []>("model_lambda_7_clip_by_value_Minimum_y_to_fp16"), val = tensor<fp16, []>(0x1.cccp-1)];
            tensor<fp16, [1, 16, 160, 288]> model_lambda_7_clip_by_value_Minimum_cast_fp16 = minimum(x = model_conv2d_34_Sigmoid_cast_fp16, y = model_lambda_7_clip_by_value_Minimum_y_to_fp16)[name = tensor<string, []>("model_lambda_7_clip_by_value_Minimum_cast_fp16")];
            tensor<int32, [8]> pad_5_pad_0 = const()[name = tensor<string, []>("pad_5_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 1, 2, 1, 2])];
            tensor<fp16, []> const_1_to_fp16 = const()[name = tensor<string, []>("const_1_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 72, 83, 147]> pad_5_cast_fp16 = pad(constant_val = const_1_to_fp16, mode = pad_1_mode_0, pad = pad_5_pad_0, x = model_re_lu_6_Relu_cast_fp16)[name = tensor<string, []>("pad_5_cast_fp16")];
            tensor<string, []> model_expanded_conv_3_depthwise_depthwisex_pad_type_0 = const()[name = tensor<string, []>("model_expanded_conv_3_depthwise_depthwisex_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> model_expanded_conv_3_depthwise_depthwisex_strides_0 = const()[name = tensor<string, []>("model_expanded_conv_3_depthwise_depthwisex_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> model_expanded_conv_3_depthwise_depthwisex_dilations_0 = const()[name = tensor<string, []>("model_expanded_conv_3_depthwise_depthwisex_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_expanded_conv_3_depthwise_depthwisex_groups_0 = const()[name = tensor<string, []>("model_expanded_conv_3_depthwise_depthwisex_groups_0"), val = tensor<int32, []>(72)];
            tensor<int32, [4]> model_expanded_conv_3_depthwise_depthwisex_pad_0 = const()[name = tensor<string, []>("model_expanded_conv_3_depthwise_depthwisex_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [72, 1, 5, 5]> const_229_to_fp16 = const()[name = tensor<string, []>("const_229_to_fp16"), val = tensor<fp16, [72, 1, 5, 5]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(35200)))];
            tensor<fp16, [72]> const_230_to_fp16 = const()[name = tensor<string, []>("const_230_to_fp16"), val = tensor<fp16, [72]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(38912)))];
            tensor<fp16, [1, 72, 40, 72]> model_expanded_conv_3_depthwise_BatchNorm_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_230_to_fp16, dilations = model_expanded_conv_3_depthwise_depthwisex_dilations_0, groups = model_expanded_conv_3_depthwise_depthwisex_groups_0, pad = model_expanded_conv_3_depthwise_depthwisex_pad_0, pad_type = model_expanded_conv_3_depthwise_depthwisex_pad_type_0, strides = model_expanded_conv_3_depthwise_depthwisex_strides_0, weight = const_229_to_fp16, x = pad_5_cast_fp16)[name = tensor<string, []>("model_expanded_conv_3_depthwise_BatchNorm_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, []> model_lambda_7_clip_by_value_y_to_fp16 = const()[name = tensor<string, []>("model_lambda_7_clip_by_value_y_to_fp16"), val = tensor<fp16, []>(0x1.998p-4)];
            tensor<fp16, [1, 16, 160, 288]> model_lambda_7_clip_by_value_cast_fp16 = maximum(x = model_lambda_7_clip_by_value_Minimum_cast_fp16, y = model_lambda_7_clip_by_value_y_to_fp16)[name = tensor<string, []>("model_lambda_7_clip_by_value_cast_fp16")];
            tensor<int32, [2]> model_global_average_pooling2d_5_Mean_axes_0 = const()[name = tensor<string, []>("model_global_average_pooling2d_5_Mean_axes_0"), val = tensor<int32, [2]>([1, 2])];
            tensor<bool, []> model_global_average_pooling2d_5_Mean_keep_dims_0 = const()[name = tensor<string, []>("model_global_average_pooling2d_5_Mean_keep_dims_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_376_perm_0 = const()[name = tensor<string, []>("transpose_376_perm_0"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<fp16, [1, 80, 144, 32]> transpose_376_cast_fp16 = transpose(perm = transpose_376_perm_0, x = model_conv2d_22_BiasAdd_cast_fp16)[name = tensor<string, []>("transpose_400")];
            tensor<fp16, [1, 32]> model_global_average_pooling2d_5_Mean_cast_fp16 = reduce_mean(axes = model_global_average_pooling2d_5_Mean_axes_0, keep_dims = model_global_average_pooling2d_5_Mean_keep_dims_0, x = transpose_376_cast_fp16)[name = tensor<string, []>("model_global_average_pooling2d_5_Mean_cast_fp16")];
            tensor<int32, [2]> model_global_max_pooling2d_3_Max_axes_0 = const()[name = tensor<string, []>("model_global_max_pooling2d_3_Max_axes_0"), val = tensor<int32, [2]>([1, 2])];
            tensor<bool, []> model_global_max_pooling2d_3_Max_keep_dims_0 = const()[name = tensor<string, []>("model_global_max_pooling2d_3_Max_keep_dims_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 32]> model_global_max_pooling2d_3_Max_cast_fp16 = reduce_max(axes = model_global_max_pooling2d_3_Max_axes_0, keep_dims = model_global_max_pooling2d_3_Max_keep_dims_0, x = transpose_376_cast_fp16)[name = tensor<string, []>("model_global_max_pooling2d_3_Max_cast_fp16")];
            tensor<fp16, [1, 16, 160, 288]> model_subtract_3_sub_cast_fp16 = sub(x = model_multiply_38_mul_cast_fp16, y = model_lambda_7_clip_by_value_cast_fp16)[name = tensor<string, []>("model_subtract_3_sub_cast_fp16")];
            tensor<fp16, [1, 72, 40, 72]> model_re_lu_7_Relu_cast_fp16 = relu(x = model_expanded_conv_3_depthwise_BatchNorm_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_re_lu_7_Relu_cast_fp16")];
            tensor<bool, []> model_concatenate_8_concat_interleave_0 = const()[name = tensor<string, []>("model_concatenate_8_concat_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 64]> model_concatenate_8_concat_cast_fp16 = concat(axis = model_concatenate_8_concat_axis, interleave = model_concatenate_8_concat_interleave_0, values = (model_global_average_pooling2d_5_Mean_cast_fp16, model_global_max_pooling2d_3_Max_cast_fp16))[name = tensor<string, []>("model_concatenate_8_concat_cast_fp16")];
            tensor<string, []> model_conv2d_35_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_conv2d_35_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_conv2d_35_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_conv2d_35_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_conv2d_35_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_conv2d_35_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_conv2d_35_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_conv2d_35_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_conv2d_35_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_conv2d_35_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 16, 1, 1]> transpose_39_to_fp16 = const()[name = tensor<string, []>("transpose_39_to_fp16"), val = tensor<fp16, [16, 16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39168)))];
            tensor<fp16, [16]> const_119_to_fp16 = const()[name = tensor<string, []>("const_119_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39744)))];
            tensor<fp16, [1, 16, 160, 288]> model_conv2d_35_BiasAdd_cast_fp16 = conv(bias = const_119_to_fp16, dilations = model_conv2d_35_Conv2Dx_dilations_0, groups = model_conv2d_35_Conv2Dx_groups_0, pad = model_conv2d_35_Conv2Dx_pad_0, pad_type = model_conv2d_35_Conv2Dx_pad_type_0, strides = model_conv2d_35_Conv2Dx_strides_0, weight = transpose_39_to_fp16, x = model_subtract_3_sub_cast_fp16)[name = tensor<string, []>("model_conv2d_35_BiasAdd_cast_fp16")];
            tensor<bool, []> model_expanded_conv_3_squeeze_excite_AvgPool_Mean_keep_dims_0 = const()[name = tensor<string, []>("model_expanded_conv_3_squeeze_excite_AvgPool_Mean_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<int32, [2]> const_13 = const()[name = tensor<string, []>("const_13"), val = tensor<int32, [2]>([2, 3])];
            tensor<fp16, [1, 72, 1, 1]> model_expanded_conv_3_squeeze_excite_AvgPool_Mean_cast_fp16 = reduce_mean(axes = const_13, keep_dims = model_expanded_conv_3_squeeze_excite_AvgPool_Mean_keep_dims_0, x = model_re_lu_7_Relu_cast_fp16)[name = tensor<string, []>("model_expanded_conv_3_squeeze_excite_AvgPool_Mean_cast_fp16")];
            tensor<fp16, [8, 64]> transpose_347_cast_fp16_to_fp32_to_fp16 = const()[name = tensor<string, []>("transpose_347_cast_fp16_to_fp32_to_fp16"), val = tensor<fp16, [8, 64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39872)))];
            tensor<fp16, [8]> model_dense_9_BiasAdd_bias_0_to_fp16 = const()[name = tensor<string, []>("model_dense_9_BiasAdd_bias_0_to_fp16"), val = tensor<fp16, [8]>([-0x1.dcp-6, -0x1.aap-6, -0x1.334p-7, -0x1.4ecp-6, -0x1.134p-3, -0x1.b5cp-7, -0x1.2ecp-7, -0x1.2a4p-5])];
            tensor<fp16, [1, 8]> model_dense_9_BiasAdd_cast_fp16 = linear(bias = model_dense_9_BiasAdd_bias_0_to_fp16, weight = transpose_347_cast_fp16_to_fp32_to_fp16, x = model_concatenate_8_concat_cast_fp16)[name = tensor<string, []>("model_dense_9_BiasAdd_cast_fp16")];
