program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3405.2.1"}, {"coremlc-version", "3404.23.1"}, {"coremltools-component-tensorflow", "2.16.2"}, {"coremltools-version", "8.2"}})]
{
    func main<ios15>(tensor<fp32, [1, 3, 160, 256]> input) {
            tensor<string, []> input_to_fp16_dtype_0 = const()[name = tensor<string, []>("input_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, []> model_1_model_rescaling_Cast_x_to_fp16 = const()[name = tensor<string, []>("model_1_model_rescaling_Cast_x_to_fp16"), val = tensor<fp16, []>(0x1.01p-7)];
            tensor<fp16, [1, 3, 160, 256]> input_to_fp16 = cast(dtype = input_to_fp16_dtype_0, x = input)[name = tensor<string, []>("cast_67")];
            tensor<fp16, [1, 3, 160, 256]> model_1_model_rescaling_mul_cast_fp16 = mul(x = input_to_fp16, y = model_1_model_rescaling_Cast_x_to_fp16)[name = tensor<string, []>("model_1_model_rescaling_mul_cast_fp16")];
            tensor<fp16, []> model_1_model_rescaling_Cast_1_to_fp16 = const()[name = tensor<string, []>("model_1_model_rescaling_Cast_1_to_fp16"), val = tensor<fp16, []>(-0x1p+0)];
            tensor<fp16, [1, 3, 160, 256]> model_1_model_rescaling_add_cast_fp16 = add(x = model_1_model_rescaling_mul_cast_fp16, y = model_1_model_rescaling_Cast_1_to_fp16)[name = tensor<string, []>("model_1_model_rescaling_add_cast_fp16")];
            tensor<string, []> model_1_model_Conv_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_1_model_Conv_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_1_model_Conv_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_1_model_Conv_Conv2Dx_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> model_1_model_Conv_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_1_model_Conv_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_1_model_Conv_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_1_model_Conv_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_1_model_Conv_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_1_model_Conv_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 3, 3, 3]> const_98_to_fp16 = const()[name = tensor<string, []>("const_98_to_fp16"), val = tensor<fp16, [16, 3, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [16]> const_99_to_fp16 = const()[name = tensor<string, []>("const_99_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1024)))];
            tensor<fp16, [1, 16, 80, 128]> model_1_model_Conv_BatchNorm_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_99_to_fp16, dilations = model_1_model_Conv_Conv2Dx_dilations_0, groups = model_1_model_Conv_Conv2Dx_groups_0, pad = model_1_model_Conv_Conv2Dx_pad_0, pad_type = model_1_model_Conv_Conv2Dx_pad_type_0, strides = model_1_model_Conv_Conv2Dx_strides_0, weight = const_98_to_fp16, x = model_1_model_rescaling_add_cast_fp16)[name = tensor<string, []>("model_1_model_Conv_BatchNorm_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, []> model_1_model_tf___operators___add_28_y_to_fp16 = const()[name = tensor<string, []>("model_1_model_tf___operators___add_28_y_to_fp16"), val = tensor<fp16, []>(0x1.8p+1)];
            tensor<fp16, [1, 16, 80, 128]> model_1_model_tf___operators___add_28_AddV2_cast_fp16 = add(x = model_1_model_Conv_BatchNorm_FusedBatchNormV3_nchw_cast_fp16, y = model_1_model_tf___operators___add_28_y_to_fp16)[name = tensor<string, []>("model_1_model_tf___operators___add_28_AddV2_cast_fp16")];
            tensor<fp16, [1, 16, 80, 128]> model_1_model_re_lu_Relu6_cast_fp16 = relu6(x = model_1_model_tf___operators___add_28_AddV2_cast_fp16)[name = tensor<string, []>("model_1_model_re_lu_Relu6_cast_fp16")];
            tensor<fp16, []> model_1_model_tf_math_multiply_27_Mul_y_to_fp16 = const()[name = tensor<string, []>("model_1_model_tf_math_multiply_27_Mul_y_to_fp16"), val = tensor<fp16, []>(0x1.554p-3)];
            tensor<fp16, [1, 16, 80, 128]> model_1_model_tf_math_multiply_27_Mul_cast_fp16 = mul(x = model_1_model_re_lu_Relu6_cast_fp16, y = model_1_model_tf_math_multiply_27_Mul_y_to_fp16)[name = tensor<string, []>("model_1_model_tf_math_multiply_27_Mul_cast_fp16")];
            tensor<fp16, [1, 16, 80, 128]> model_1_model_multiply_mul_cast_fp16 = mul(x = model_1_model_Conv_BatchNorm_FusedBatchNormV3_nchw_cast_fp16, y = model_1_model_tf_math_multiply_27_Mul_cast_fp16)[name = tensor<string, []>("model_1_model_multiply_mul_cast_fp16")];
            tensor<string, []> model_1_model_expanded_conv_depthwise_depthwisex_pad_type_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_depthwise_depthwisex_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_1_model_expanded_conv_depthwise_depthwisex_strides_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_depthwise_depthwisex_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_1_model_expanded_conv_depthwise_depthwisex_dilations_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_depthwise_depthwisex_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_1_model_expanded_conv_depthwise_depthwisex_groups_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_depthwise_depthwisex_groups_0"), val = tensor<int32, []>(16)];
            tensor<int32, [4]> model_1_model_expanded_conv_depthwise_depthwisex_pad_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_depthwise_depthwisex_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 1, 3, 3]> const_100_to_fp16 = const()[name = tensor<string, []>("const_100_to_fp16"), val = tensor<fp16, [16, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1152)))];
            tensor<fp16, [16]> const_101_to_fp16 = const()[name = tensor<string, []>("const_101_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1536)))];
            tensor<fp16, [1, 16, 80, 128]> model_1_model_expanded_conv_depthwise_BatchNorm_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_101_to_fp16, dilations = model_1_model_expanded_conv_depthwise_depthwisex_dilations_0, groups = model_1_model_expanded_conv_depthwise_depthwisex_groups_0, pad = model_1_model_expanded_conv_depthwise_depthwisex_pad_0, pad_type = model_1_model_expanded_conv_depthwise_depthwisex_pad_type_0, strides = model_1_model_expanded_conv_depthwise_depthwisex_strides_0, weight = const_100_to_fp16, x = model_1_model_multiply_mul_cast_fp16)[name = tensor<string, []>("model_1_model_expanded_conv_depthwise_BatchNorm_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, [1, 16, 80, 128]> model_1_model_re_lu_1_Relu_cast_fp16 = relu(x = model_1_model_expanded_conv_depthwise_BatchNorm_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_1_model_re_lu_1_Relu_cast_fp16")];
            tensor<string, []> model_1_model_expanded_conv_project_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_project_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_1_model_expanded_conv_project_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_project_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_1_model_expanded_conv_project_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_project_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_1_model_expanded_conv_project_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_project_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_1_model_expanded_conv_project_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_project_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 16, 1, 1]> const_102_to_fp16 = const()[name = tensor<string, []>("const_102_to_fp16"), val = tensor<fp16, [16, 16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1664)))];
            tensor<fp16, [16]> const_103_to_fp16 = const()[name = tensor<string, []>("const_103_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2240)))];
            tensor<fp16, [1, 16, 80, 128]> model_1_model_expanded_conv_project_BatchNorm_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_103_to_fp16, dilations = model_1_model_expanded_conv_project_Conv2Dx_dilations_0, groups = model_1_model_expanded_conv_project_Conv2Dx_groups_0, pad = model_1_model_expanded_conv_project_Conv2Dx_pad_0, pad_type = model_1_model_expanded_conv_project_Conv2Dx_pad_type_0, strides = model_1_model_expanded_conv_project_Conv2Dx_strides_0, weight = const_102_to_fp16, x = model_1_model_re_lu_1_Relu_cast_fp16)[name = tensor<string, []>("model_1_model_expanded_conv_project_BatchNorm_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, [1, 16, 80, 128]> model_1_model_expanded_conv_Add_add_cast_fp16 = add(x = model_1_model_multiply_mul_cast_fp16, y = model_1_model_expanded_conv_project_BatchNorm_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_1_model_expanded_conv_Add_add_cast_fp16")];
            tensor<string, []> model_1_model_expanded_conv_1_expand_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_1_expand_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_1_model_expanded_conv_1_expand_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_1_expand_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_1_model_expanded_conv_1_expand_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_1_expand_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_1_model_expanded_conv_1_expand_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_1_expand_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_1_model_expanded_conv_1_expand_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_1_expand_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 16, 1, 1]> const_104_to_fp16 = const()[name = tensor<string, []>("const_104_to_fp16"), val = tensor<fp16, [64, 16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2368)))];
            tensor<fp16, [64]> const_105_to_fp16 = const()[name = tensor<string, []>("const_105_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4480)))];
            tensor<fp16, [1, 64, 80, 128]> model_1_model_expanded_conv_1_expand_BatchNorm_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_105_to_fp16, dilations = model_1_model_expanded_conv_1_expand_Conv2Dx_dilations_0, groups = model_1_model_expanded_conv_1_expand_Conv2Dx_groups_0, pad = model_1_model_expanded_conv_1_expand_Conv2Dx_pad_0, pad_type = model_1_model_expanded_conv_1_expand_Conv2Dx_pad_type_0, strides = model_1_model_expanded_conv_1_expand_Conv2Dx_strides_0, weight = const_104_to_fp16, x = model_1_model_expanded_conv_Add_add_cast_fp16)[name = tensor<string, []>("model_1_model_expanded_conv_1_expand_BatchNorm_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, [1, 64, 80, 128]> model_1_model_re_lu_2_Relu_cast_fp16 = relu(x = model_1_model_expanded_conv_1_expand_BatchNorm_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_1_model_re_lu_2_Relu_cast_fp16")];
            tensor<string, []> pad_0_mode_0 = const()[name = tensor<string, []>("pad_0_mode_0"), val = tensor<string, []>("constant")];
            tensor<int32, [8]> pad_4_pad_0 = const()[name = tensor<string, []>("pad_4_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 0, 1, 0, 1])];
            tensor<fp16, []> const_0_to_fp16 = const()[name = tensor<string, []>("const_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 64, 81, 129]> pad_4_cast_fp16 = pad(constant_val = const_0_to_fp16, mode = pad_0_mode_0, pad = pad_4_pad_0, x = model_1_model_re_lu_2_Relu_cast_fp16)[name = tensor<string, []>("pad_4_cast_fp16")];
            tensor<string, []> model_1_model_expanded_conv_1_depthwise_depthwisex_pad_type_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_1_depthwise_depthwisex_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> model_1_model_expanded_conv_1_depthwise_depthwisex_strides_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_1_depthwise_depthwisex_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> model_1_model_expanded_conv_1_depthwise_depthwisex_dilations_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_1_depthwise_depthwisex_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_1_model_expanded_conv_1_depthwise_depthwisex_groups_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_1_depthwise_depthwisex_groups_0"), val = tensor<int32, []>(64)];
            tensor<int32, [4]> model_1_model_expanded_conv_1_depthwise_depthwisex_pad_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_1_depthwise_depthwisex_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 1, 3, 3]> const_106_to_fp16 = const()[name = tensor<string, []>("const_106_to_fp16"), val = tensor<fp16, [64, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4672)))];
            tensor<fp16, [64]> const_107_to_fp16 = const()[name = tensor<string, []>("const_107_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5888)))];
            tensor<fp16, [1, 64, 40, 64]> model_1_model_expanded_conv_1_depthwise_BatchNorm_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_107_to_fp16, dilations = model_1_model_expanded_conv_1_depthwise_depthwisex_dilations_0, groups = model_1_model_expanded_conv_1_depthwise_depthwisex_groups_0, pad = model_1_model_expanded_conv_1_depthwise_depthwisex_pad_0, pad_type = model_1_model_expanded_conv_1_depthwise_depthwisex_pad_type_0, strides = model_1_model_expanded_conv_1_depthwise_depthwisex_strides_0, weight = const_106_to_fp16, x = pad_4_cast_fp16)[name = tensor<string, []>("model_1_model_expanded_conv_1_depthwise_BatchNorm_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, [1, 64, 40, 64]> model_1_model_re_lu_3_Relu_cast_fp16 = relu(x = model_1_model_expanded_conv_1_depthwise_BatchNorm_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_1_model_re_lu_3_Relu_cast_fp16")];
            tensor<string, []> model_1_model_expanded_conv_1_project_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_1_project_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_1_model_expanded_conv_1_project_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_1_project_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_1_model_expanded_conv_1_project_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_1_project_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_1_model_expanded_conv_1_project_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_1_project_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_1_model_expanded_conv_1_project_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_1_project_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [24, 64, 1, 1]> const_108_to_fp16 = const()[name = tensor<string, []>("const_108_to_fp16"), val = tensor<fp16, [24, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(6080)))];
            tensor<fp16, [24]> const_109_to_fp16 = const()[name = tensor<string, []>("const_109_to_fp16"), val = tensor<fp16, [24]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9216)))];
            tensor<fp16, [1, 24, 40, 64]> model_1_model_expanded_conv_1_project_BatchNorm_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_109_to_fp16, dilations = model_1_model_expanded_conv_1_project_Conv2Dx_dilations_0, groups = model_1_model_expanded_conv_1_project_Conv2Dx_groups_0, pad = model_1_model_expanded_conv_1_project_Conv2Dx_pad_0, pad_type = model_1_model_expanded_conv_1_project_Conv2Dx_pad_type_0, strides = model_1_model_expanded_conv_1_project_Conv2Dx_strides_0, weight = const_108_to_fp16, x = model_1_model_re_lu_3_Relu_cast_fp16)[name = tensor<string, []>("model_1_model_expanded_conv_1_project_BatchNorm_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<string, []> model_1_model_expanded_conv_2_expand_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_2_expand_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_1_model_expanded_conv_2_expand_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_2_expand_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_1_model_expanded_conv_2_expand_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_2_expand_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_1_model_expanded_conv_2_expand_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_2_expand_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_1_model_expanded_conv_2_expand_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_2_expand_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [72, 24, 1, 1]> const_110_to_fp16 = const()[name = tensor<string, []>("const_110_to_fp16"), val = tensor<fp16, [72, 24, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(9344)))];
            tensor<fp16, [72]> const_111_to_fp16 = const()[name = tensor<string, []>("const_111_to_fp16"), val = tensor<fp16, [72]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(12864)))];
            tensor<fp16, [1, 72, 40, 64]> model_1_model_expanded_conv_2_expand_BatchNorm_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_111_to_fp16, dilations = model_1_model_expanded_conv_2_expand_Conv2Dx_dilations_0, groups = model_1_model_expanded_conv_2_expand_Conv2Dx_groups_0, pad = model_1_model_expanded_conv_2_expand_Conv2Dx_pad_0, pad_type = model_1_model_expanded_conv_2_expand_Conv2Dx_pad_type_0, strides = model_1_model_expanded_conv_2_expand_Conv2Dx_strides_0, weight = const_110_to_fp16, x = model_1_model_expanded_conv_1_project_BatchNorm_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_1_model_expanded_conv_2_expand_BatchNorm_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, [1, 72, 40, 64]> model_1_model_re_lu_4_Relu_cast_fp16 = relu(x = model_1_model_expanded_conv_2_expand_BatchNorm_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_1_model_re_lu_4_Relu_cast_fp16")];
            tensor<string, []> model_1_model_expanded_conv_2_depthwise_depthwisex_pad_type_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_2_depthwise_depthwisex_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_1_model_expanded_conv_2_depthwise_depthwisex_strides_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_2_depthwise_depthwisex_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_1_model_expanded_conv_2_depthwise_depthwisex_dilations_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_2_depthwise_depthwisex_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_1_model_expanded_conv_2_depthwise_depthwisex_groups_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_2_depthwise_depthwisex_groups_0"), val = tensor<int32, []>(72)];
            tensor<int32, [4]> model_1_model_expanded_conv_2_depthwise_depthwisex_pad_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_2_depthwise_depthwisex_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [72, 1, 3, 3]> const_112_to_fp16 = const()[name = tensor<string, []>("const_112_to_fp16"), val = tensor<fp16, [72, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13120)))];
            tensor<fp16, [72]> const_113_to_fp16 = const()[name = tensor<string, []>("const_113_to_fp16"), val = tensor<fp16, [72]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14528)))];
            tensor<fp16, [1, 72, 40, 64]> model_1_model_expanded_conv_2_depthwise_BatchNorm_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_113_to_fp16, dilations = model_1_model_expanded_conv_2_depthwise_depthwisex_dilations_0, groups = model_1_model_expanded_conv_2_depthwise_depthwisex_groups_0, pad = model_1_model_expanded_conv_2_depthwise_depthwisex_pad_0, pad_type = model_1_model_expanded_conv_2_depthwise_depthwisex_pad_type_0, strides = model_1_model_expanded_conv_2_depthwise_depthwisex_strides_0, weight = const_112_to_fp16, x = model_1_model_re_lu_4_Relu_cast_fp16)[name = tensor<string, []>("model_1_model_expanded_conv_2_depthwise_BatchNorm_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, [1, 72, 40, 64]> model_1_model_re_lu_5_Relu_cast_fp16 = relu(x = model_1_model_expanded_conv_2_depthwise_BatchNorm_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_1_model_re_lu_5_Relu_cast_fp16")];
            tensor<string, []> model_1_model_expanded_conv_2_project_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_2_project_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_1_model_expanded_conv_2_project_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_2_project_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_1_model_expanded_conv_2_project_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_2_project_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_1_model_expanded_conv_2_project_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_2_project_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_1_model_expanded_conv_2_project_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_2_project_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [24, 72, 1, 1]> const_114_to_fp16 = const()[name = tensor<string, []>("const_114_to_fp16"), val = tensor<fp16, [24, 72, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14784)))];
            tensor<fp16, [24]> const_115_to_fp16 = const()[name = tensor<string, []>("const_115_to_fp16"), val = tensor<fp16, [24]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18304)))];
            tensor<fp16, [1, 24, 40, 64]> model_1_model_expanded_conv_2_project_BatchNorm_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_115_to_fp16, dilations = model_1_model_expanded_conv_2_project_Conv2Dx_dilations_0, groups = model_1_model_expanded_conv_2_project_Conv2Dx_groups_0, pad = model_1_model_expanded_conv_2_project_Conv2Dx_pad_0, pad_type = model_1_model_expanded_conv_2_project_Conv2Dx_pad_type_0, strides = model_1_model_expanded_conv_2_project_Conv2Dx_strides_0, weight = const_114_to_fp16, x = model_1_model_re_lu_5_Relu_cast_fp16)[name = tensor<string, []>("model_1_model_expanded_conv_2_project_BatchNorm_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, [1, 24, 40, 64]> model_1_model_expanded_conv_2_Add_add_cast_fp16 = add(x = model_1_model_expanded_conv_1_project_BatchNorm_FusedBatchNormV3_nchw_cast_fp16, y = model_1_model_expanded_conv_2_project_BatchNorm_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_1_model_expanded_conv_2_Add_add_cast_fp16")];
            tensor<string, []> model_1_model_expanded_conv_3_expand_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_3_expand_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_1_model_expanded_conv_3_expand_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_3_expand_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_1_model_expanded_conv_3_expand_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_3_expand_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_1_model_expanded_conv_3_expand_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_3_expand_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_1_model_expanded_conv_3_expand_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_3_expand_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [72, 24, 1, 1]> const_116_to_fp16 = const()[name = tensor<string, []>("const_116_to_fp16"), val = tensor<fp16, [72, 24, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(18432)))];
            tensor<fp16, [72]> const_117_to_fp16 = const()[name = tensor<string, []>("const_117_to_fp16"), val = tensor<fp16, [72]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21952)))];
            tensor<fp16, [1, 72, 40, 64]> model_1_model_expanded_conv_3_expand_BatchNorm_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_117_to_fp16, dilations = model_1_model_expanded_conv_3_expand_Conv2Dx_dilations_0, groups = model_1_model_expanded_conv_3_expand_Conv2Dx_groups_0, pad = model_1_model_expanded_conv_3_expand_Conv2Dx_pad_0, pad_type = model_1_model_expanded_conv_3_expand_Conv2Dx_pad_type_0, strides = model_1_model_expanded_conv_3_expand_Conv2Dx_strides_0, weight = const_116_to_fp16, x = model_1_model_expanded_conv_2_Add_add_cast_fp16)[name = tensor<string, []>("model_1_model_expanded_conv_3_expand_BatchNorm_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, [1, 72, 40, 64]> model_1_model_re_lu_6_Relu_cast_fp16 = relu(x = model_1_model_expanded_conv_3_expand_BatchNorm_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_1_model_re_lu_6_Relu_cast_fp16")];
            tensor<string, []> pad_1_mode_0 = const()[name = tensor<string, []>("pad_1_mode_0"), val = tensor<string, []>("constant")];
            tensor<int32, [8]> pad_5_pad_0 = const()[name = tensor<string, []>("pad_5_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 1, 2, 1, 2])];
            tensor<fp16, []> const_1_to_fp16 = const()[name = tensor<string, []>("const_1_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 72, 43, 67]> pad_5_cast_fp16 = pad(constant_val = const_1_to_fp16, mode = pad_1_mode_0, pad = pad_5_pad_0, x = model_1_model_re_lu_6_Relu_cast_fp16)[name = tensor<string, []>("pad_5_cast_fp16")];
            tensor<string, []> model_1_model_expanded_conv_3_depthwise_depthwisex_pad_type_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_3_depthwise_depthwisex_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> model_1_model_expanded_conv_3_depthwise_depthwisex_strides_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_3_depthwise_depthwisex_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> model_1_model_expanded_conv_3_depthwise_depthwisex_dilations_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_3_depthwise_depthwisex_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_1_model_expanded_conv_3_depthwise_depthwisex_groups_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_3_depthwise_depthwisex_groups_0"), val = tensor<int32, []>(72)];
            tensor<int32, [4]> model_1_model_expanded_conv_3_depthwise_depthwisex_pad_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_3_depthwise_depthwisex_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [72, 1, 5, 5]> const_118_to_fp16 = const()[name = tensor<string, []>("const_118_to_fp16"), val = tensor<fp16, [72, 1, 5, 5]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(22208)))];
            tensor<fp16, [72]> const_119_to_fp16 = const()[name = tensor<string, []>("const_119_to_fp16"), val = tensor<fp16, [72]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25920)))];
            tensor<fp16, [1, 72, 20, 32]> model_1_model_expanded_conv_3_depthwise_BatchNorm_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_119_to_fp16, dilations = model_1_model_expanded_conv_3_depthwise_depthwisex_dilations_0, groups = model_1_model_expanded_conv_3_depthwise_depthwisex_groups_0, pad = model_1_model_expanded_conv_3_depthwise_depthwisex_pad_0, pad_type = model_1_model_expanded_conv_3_depthwise_depthwisex_pad_type_0, strides = model_1_model_expanded_conv_3_depthwise_depthwisex_strides_0, weight = const_118_to_fp16, x = pad_5_cast_fp16)[name = tensor<string, []>("model_1_model_expanded_conv_3_depthwise_BatchNorm_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, [1, 72, 20, 32]> model_1_model_re_lu_7_Relu_cast_fp16 = relu(x = model_1_model_expanded_conv_3_depthwise_BatchNorm_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_1_model_re_lu_7_Relu_cast_fp16")];
            tensor<bool, []> model_1_model_expanded_conv_3_squeeze_excite_AvgPool_Mean_keep_dims_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_3_squeeze_excite_AvgPool_Mean_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<int32, [2]> const_6 = const()[name = tensor<string, []>("const_6"), val = tensor<int32, [2]>([2, 3])];
            tensor<fp16, [1, 72, 1, 1]> model_1_model_expanded_conv_3_squeeze_excite_AvgPool_Mean_cast_fp16 = reduce_mean(axes = const_6, keep_dims = model_1_model_expanded_conv_3_squeeze_excite_AvgPool_Mean_keep_dims_0, x = model_1_model_re_lu_7_Relu_cast_fp16)[name = tensor<string, []>("model_1_model_expanded_conv_3_squeeze_excite_AvgPool_Mean_cast_fp16")];
            tensor<string, []> model_1_model_expanded_conv_3_squeeze_excite_Conv_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_3_squeeze_excite_Conv_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_1_model_expanded_conv_3_squeeze_excite_Conv_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_3_squeeze_excite_Conv_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_1_model_expanded_conv_3_squeeze_excite_Conv_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_3_squeeze_excite_Conv_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_1_model_expanded_conv_3_squeeze_excite_Conv_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_3_squeeze_excite_Conv_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_1_model_expanded_conv_3_squeeze_excite_Conv_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_3_squeeze_excite_Conv_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [24, 72, 1, 1]> transpose_33_to_fp16 = const()[name = tensor<string, []>("transpose_33_to_fp16"), val = tensor<fp16, [24, 72, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(26176)))];
            tensor<fp16, [24]> const_53_to_fp16 = const()[name = tensor<string, []>("const_53_to_fp16"), val = tensor<fp16, [24]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(29696)))];
            tensor<fp16, [1, 24, 1, 1]> model_1_model_expanded_conv_3_squeeze_excite_Conv_BiasAdd_cast_fp16 = conv(bias = const_53_to_fp16, dilations = model_1_model_expanded_conv_3_squeeze_excite_Conv_Conv2Dx_dilations_0, groups = model_1_model_expanded_conv_3_squeeze_excite_Conv_Conv2Dx_groups_0, pad = model_1_model_expanded_conv_3_squeeze_excite_Conv_Conv2Dx_pad_0, pad_type = model_1_model_expanded_conv_3_squeeze_excite_Conv_Conv2Dx_pad_type_0, strides = model_1_model_expanded_conv_3_squeeze_excite_Conv_Conv2Dx_strides_0, weight = transpose_33_to_fp16, x = model_1_model_expanded_conv_3_squeeze_excite_AvgPool_Mean_cast_fp16)[name = tensor<string, []>("model_1_model_expanded_conv_3_squeeze_excite_Conv_BiasAdd_cast_fp16")];
            tensor<fp16, [1, 24, 1, 1]> model_1_model_expanded_conv_3_squeeze_excite_Relu_Relu_cast_fp16 = relu(x = model_1_model_expanded_conv_3_squeeze_excite_Conv_BiasAdd_cast_fp16)[name = tensor<string, []>("model_1_model_expanded_conv_3_squeeze_excite_Relu_Relu_cast_fp16")];
            tensor<string, []> model_1_model_expanded_conv_3_squeeze_excite_Conv_1_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_3_squeeze_excite_Conv_1_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_1_model_expanded_conv_3_squeeze_excite_Conv_1_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_3_squeeze_excite_Conv_1_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_1_model_expanded_conv_3_squeeze_excite_Conv_1_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_3_squeeze_excite_Conv_1_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_1_model_expanded_conv_3_squeeze_excite_Conv_1_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_3_squeeze_excite_Conv_1_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_1_model_expanded_conv_3_squeeze_excite_Conv_1_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_3_squeeze_excite_Conv_1_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [72, 24, 1, 1]> transpose_35_to_fp16 = const()[name = tensor<string, []>("transpose_35_to_fp16"), val = tensor<fp16, [72, 24, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(29824)))];
            tensor<fp16, [72]> const_90_to_fp16 = const()[name = tensor<string, []>("const_90_to_fp16"), val = tensor<fp16, [72]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(33344)))];
            tensor<fp16, [1, 72, 1, 1]> model_1_model_tf___operators___add_29_AddV2_cast_fp16 = conv(bias = const_90_to_fp16, dilations = model_1_model_expanded_conv_3_squeeze_excite_Conv_1_Conv2Dx_dilations_0, groups = model_1_model_expanded_conv_3_squeeze_excite_Conv_1_Conv2Dx_groups_0, pad = model_1_model_expanded_conv_3_squeeze_excite_Conv_1_Conv2Dx_pad_0, pad_type = model_1_model_expanded_conv_3_squeeze_excite_Conv_1_Conv2Dx_pad_type_0, strides = model_1_model_expanded_conv_3_squeeze_excite_Conv_1_Conv2Dx_strides_0, weight = transpose_35_to_fp16, x = model_1_model_expanded_conv_3_squeeze_excite_Relu_Relu_cast_fp16)[name = tensor<string, []>("model_1_model_tf___operators___add_29_AddV2_cast_fp16")];
            tensor<fp16, [1, 72, 1, 1]> model_1_model_re_lu_8_Relu6_cast_fp16 = relu6(x = model_1_model_tf___operators___add_29_AddV2_cast_fp16)[name = tensor<string, []>("model_1_model_re_lu_8_Relu6_cast_fp16")];
            tensor<fp16, []> model_1_model_tf_math_multiply_28_Mul_y_to_fp16 = const()[name = tensor<string, []>("model_1_model_tf_math_multiply_28_Mul_y_to_fp16"), val = tensor<fp16, []>(0x1.554p-3)];
            tensor<fp16, [1, 72, 1, 1]> model_1_model_tf_math_multiply_28_Mul_cast_fp16 = mul(x = model_1_model_re_lu_8_Relu6_cast_fp16, y = model_1_model_tf_math_multiply_28_Mul_y_to_fp16)[name = tensor<string, []>("model_1_model_tf_math_multiply_28_Mul_cast_fp16")];
            tensor<fp16, [1, 72, 20, 32]> model_1_model_expanded_conv_3_squeeze_excite_Mul_mul_cast_fp16 = mul(x = model_1_model_re_lu_7_Relu_cast_fp16, y = model_1_model_tf_math_multiply_28_Mul_cast_fp16)[name = tensor<string, []>("model_1_model_expanded_conv_3_squeeze_excite_Mul_mul_cast_fp16")];
            tensor<string, []> model_1_model_expanded_conv_3_project_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_3_project_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_1_model_expanded_conv_3_project_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_3_project_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_1_model_expanded_conv_3_project_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_3_project_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_1_model_expanded_conv_3_project_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_3_project_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_1_model_expanded_conv_3_project_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_3_project_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [40, 72, 1, 1]> const_120_to_fp16 = const()[name = tensor<string, []>("const_120_to_fp16"), val = tensor<fp16, [40, 72, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(33600)))];
            tensor<fp16, [40]> const_121_to_fp16 = const()[name = tensor<string, []>("const_121_to_fp16"), val = tensor<fp16, [40]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39424)))];
            tensor<fp16, [1, 40, 20, 32]> model_1_model_expanded_conv_3_project_BatchNorm_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_121_to_fp16, dilations = model_1_model_expanded_conv_3_project_Conv2Dx_dilations_0, groups = model_1_model_expanded_conv_3_project_Conv2Dx_groups_0, pad = model_1_model_expanded_conv_3_project_Conv2Dx_pad_0, pad_type = model_1_model_expanded_conv_3_project_Conv2Dx_pad_type_0, strides = model_1_model_expanded_conv_3_project_Conv2Dx_strides_0, weight = const_120_to_fp16, x = model_1_model_expanded_conv_3_squeeze_excite_Mul_mul_cast_fp16)[name = tensor<string, []>("model_1_model_expanded_conv_3_project_BatchNorm_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<string, []> model_1_model_expanded_conv_4_expand_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_4_expand_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_1_model_expanded_conv_4_expand_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_4_expand_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_1_model_expanded_conv_4_expand_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_4_expand_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_1_model_expanded_conv_4_expand_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_4_expand_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_1_model_expanded_conv_4_expand_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_4_expand_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [120, 40, 1, 1]> const_122_to_fp16 = const()[name = tensor<string, []>("const_122_to_fp16"), val = tensor<fp16, [120, 40, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(39616)))];
            tensor<fp16, [120]> const_123_to_fp16 = const()[name = tensor<string, []>("const_123_to_fp16"), val = tensor<fp16, [120]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(49280)))];
            tensor<fp16, [1, 120, 20, 32]> model_1_model_expanded_conv_4_expand_BatchNorm_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_123_to_fp16, dilations = model_1_model_expanded_conv_4_expand_Conv2Dx_dilations_0, groups = model_1_model_expanded_conv_4_expand_Conv2Dx_groups_0, pad = model_1_model_expanded_conv_4_expand_Conv2Dx_pad_0, pad_type = model_1_model_expanded_conv_4_expand_Conv2Dx_pad_type_0, strides = model_1_model_expanded_conv_4_expand_Conv2Dx_strides_0, weight = const_122_to_fp16, x = model_1_model_expanded_conv_3_project_BatchNorm_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_1_model_expanded_conv_4_expand_BatchNorm_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, [1, 120, 20, 32]> model_1_model_re_lu_9_Relu_cast_fp16 = relu(x = model_1_model_expanded_conv_4_expand_BatchNorm_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_1_model_re_lu_9_Relu_cast_fp16")];
            tensor<string, []> model_1_model_expanded_conv_4_depthwise_depthwisex_pad_type_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_4_depthwise_depthwisex_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_1_model_expanded_conv_4_depthwise_depthwisex_strides_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_4_depthwise_depthwisex_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_1_model_expanded_conv_4_depthwise_depthwisex_dilations_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_4_depthwise_depthwisex_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_1_model_expanded_conv_4_depthwise_depthwisex_groups_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_4_depthwise_depthwisex_groups_0"), val = tensor<int32, []>(120)];
            tensor<int32, [4]> model_1_model_expanded_conv_4_depthwise_depthwisex_pad_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_4_depthwise_depthwisex_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [120, 1, 5, 5]> const_124_to_fp16 = const()[name = tensor<string, []>("const_124_to_fp16"), val = tensor<fp16, [120, 1, 5, 5]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(49600)))];
            tensor<fp16, [120]> const_125_to_fp16 = const()[name = tensor<string, []>("const_125_to_fp16"), val = tensor<fp16, [120]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(55680)))];
            tensor<fp16, [1, 120, 20, 32]> model_1_model_expanded_conv_4_depthwise_BatchNorm_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_125_to_fp16, dilations = model_1_model_expanded_conv_4_depthwise_depthwisex_dilations_0, groups = model_1_model_expanded_conv_4_depthwise_depthwisex_groups_0, pad = model_1_model_expanded_conv_4_depthwise_depthwisex_pad_0, pad_type = model_1_model_expanded_conv_4_depthwise_depthwisex_pad_type_0, strides = model_1_model_expanded_conv_4_depthwise_depthwisex_strides_0, weight = const_124_to_fp16, x = model_1_model_re_lu_9_Relu_cast_fp16)[name = tensor<string, []>("model_1_model_expanded_conv_4_depthwise_BatchNorm_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<fp16, [1, 120, 20, 32]> model_1_model_re_lu_10_Relu_cast_fp16 = relu(x = model_1_model_expanded_conv_4_depthwise_BatchNorm_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_1_model_re_lu_10_Relu_cast_fp16")];
            tensor<bool, []> model_1_model_expanded_conv_4_squeeze_excite_AvgPool_Mean_keep_dims_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_4_squeeze_excite_AvgPool_Mean_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<int32, [2]> const_9 = const()[name = tensor<string, []>("const_9"), val = tensor<int32, [2]>([2, 3])];
            tensor<fp16, [1, 120, 1, 1]> model_1_model_expanded_conv_4_squeeze_excite_AvgPool_Mean_cast_fp16 = reduce_mean(axes = const_9, keep_dims = model_1_model_expanded_conv_4_squeeze_excite_AvgPool_Mean_keep_dims_0, x = model_1_model_re_lu_10_Relu_cast_fp16)[name = tensor<string, []>("model_1_model_expanded_conv_4_squeeze_excite_AvgPool_Mean_cast_fp16")];
            tensor<string, []> model_1_model_expanded_conv_4_squeeze_excite_Conv_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_4_squeeze_excite_Conv_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_1_model_expanded_conv_4_squeeze_excite_Conv_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_4_squeeze_excite_Conv_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_1_model_expanded_conv_4_squeeze_excite_Conv_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_4_squeeze_excite_Conv_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_1_model_expanded_conv_4_squeeze_excite_Conv_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_4_squeeze_excite_Conv_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_1_model_expanded_conv_4_squeeze_excite_Conv_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_4_squeeze_excite_Conv_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 120, 1, 1]> transpose_46_to_fp16 = const()[name = tensor<string, []>("transpose_46_to_fp16"), val = tensor<fp16, [32, 120, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(56000)))];
            tensor<fp16, [32]> const_55_to_fp16 = const()[name = tensor<string, []>("const_55_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(63744)))];
            tensor<fp16, [1, 32, 1, 1]> model_1_model_expanded_conv_4_squeeze_excite_Conv_BiasAdd_cast_fp16 = conv(bias = const_55_to_fp16, dilations = model_1_model_expanded_conv_4_squeeze_excite_Conv_Conv2Dx_dilations_0, groups = model_1_model_expanded_conv_4_squeeze_excite_Conv_Conv2Dx_groups_0, pad = model_1_model_expanded_conv_4_squeeze_excite_Conv_Conv2Dx_pad_0, pad_type = model_1_model_expanded_conv_4_squeeze_excite_Conv_Conv2Dx_pad_type_0, strides = model_1_model_expanded_conv_4_squeeze_excite_Conv_Conv2Dx_strides_0, weight = transpose_46_to_fp16, x = model_1_model_expanded_conv_4_squeeze_excite_AvgPool_Mean_cast_fp16)[name = tensor<string, []>("model_1_model_expanded_conv_4_squeeze_excite_Conv_BiasAdd_cast_fp16")];
            tensor<fp16, [1, 32, 1, 1]> model_1_model_expanded_conv_4_squeeze_excite_Relu_Relu_cast_fp16 = relu(x = model_1_model_expanded_conv_4_squeeze_excite_Conv_BiasAdd_cast_fp16)[name = tensor<string, []>("model_1_model_expanded_conv_4_squeeze_excite_Relu_Relu_cast_fp16")];
            tensor<string, []> model_1_model_expanded_conv_4_squeeze_excite_Conv_1_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_4_squeeze_excite_Conv_1_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_1_model_expanded_conv_4_squeeze_excite_Conv_1_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_4_squeeze_excite_Conv_1_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_1_model_expanded_conv_4_squeeze_excite_Conv_1_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_4_squeeze_excite_Conv_1_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_1_model_expanded_conv_4_squeeze_excite_Conv_1_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_1_model_expanded_conv_4_squeeze_excite_Conv_1_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
